app/controllers/points_controller.rb

  def index
    respond_with Point.all
---
SELECT "points".* FROM "points"

    def set_point
      @point = Point.find(params[:id])
---
SELECT "points".* FROM "points" WHERE "points"."id" = ? LIMIT 1  [["id", "1"]]